import json
import os
from transformers import pipeline

MODEL_PATH = "./model_distilbert"#-----------------------------------------------------------------путь до ии 
DATA_FILE = "./mock_data.json"#---------------------------------------------------------------путь к мок дате
RESULTS_FILE = "./results.txt"#--------------------------------------------------------------------путь к файлу для записи результатов


try:#----------------------------------------------------------------------------------------------загружаем через try чтобы проверить ошибки
    classifier = pipeline("sentiment-analysis", model=MODEL_PATH)#---------------------------------вызываем нашу модель через pipeline который мы получили из библиотеки transformersб, передаем в него задачу sentiment-analysis(анализ тональности) и путь к папки ии model=MODEL_PATH
except Exception as err:#--------------------------------------------------------------------------если ошибка то записывем ее в err(error) 
    print(f"error with loading ai: {err}")#--------------------------------------------------------и выводим
    classifier = None#-----------------------------------------------------------------------------так как ии не загрузилась из-за ошибки то мы обозначаем эту модель пустую


def load_reviews():#-------------------------------------------------------------------------------эта функция читает файл с мок датой 
    try:#------------------------------------------------------------------------------------------пробуем
        f = open(DATA_FILE, "r", encoding="utf-8")#-------------------------------------------------открыть файл, указываем путь (DATA_FILE), метод 'r' чтение и формат encoding="utf-8"
        data = json.load(f)#-----------------------------------------------------------------------получаем данные переводя json формат
        f.close()#---------------------------------------------------------------------------------закрываем подключение к файлу
    except Exception as err:#----------------------------------------------------------------------если ошибка то записываем в err
        print(f"Error with reading file: {err}")#--------------------------------------------------выводим
        return []#---------------------------------------------------------------------------------возвращаем пустоту
    reviews = []#----------------------------------------------------------------------------------список отзывов в который ми запишем их
    for item in data:#-----------------------------------------------------------------------------перебираем данные из файла мок даты
        if item != '' and item is None:#-----------------------------------------------------------проверяем на пустотность чтобы
            continue#------------------------------------------------------------------------------пропустить мусор
        if type(item) == str:#---------------------------------------------------------------------если строка то
            reviews.append(item)#------------------------------------------------------------------записываем текст
    return reviews
    

def analyze_text(text):#---------------------------------------------------------------------------функция которая получает текст и вохвращает два значения (Positive/Negative) и увереность ии в этом в числовом формате
    if classifier is None:#------------------------------------------------------------------------проверка загрузилась ли ии 
        return "ERROR", 0.0#-----------------------------------------------------------------------возвращаем ощибку, почему 0.0? потому что мы возвращаем 1-строчное значение позитив или негатив и 2-увереность поэтому 0.0
    try:#------------------------------------------------------------------------------------------пробуем
        result = classifier(text)#-----------------------------------------------------------------загрузить наш текст в ии
    except Exception as e:#------------------------------------------------------------------------если не получилось то
        print(f"Error with analyze text: {e}")#----------------------------------------------------выводим ошибку
        return "ERROR", 0.0#-----------------------------------------------------------------------возвращаем ошибку
    first_item = result[0]#------------------------------------------------------------------------контейнер для значений
    label = first_item["label"]#-------------------------------------------------------------------(Positive/Negativw)
    score = first_item["score"]#-------------------------------------------------------------------увереность ии 
    return label, score #--------------------------------------------------------------------------возвращаем результат


def analyze_list(reviews):#------------------------------------------------------------------------принимает список отззывов
    if len(reviews) == 0:#-------------------------------------------------------------------------если мы передали пустоту то
        print(f"list is empty")#-------------------------------------------------------------------вохвращет соответ ответ
        return#------------------------------------------------------------------------------------пусто
    positives = 0#---------------------------------------------------------------------------------счетчик негатива
    negatives = 0#---------------------------------------------------------------------------------счетчик позитива
    results = []#----------------------------------------------------------------------------------контейнер для результата
    number = 1#------------------------------------------------------------------------------------для нумерации при переборе списка
    for text in reviews:#--------------------------------------------------------------------------беребираем список
        label, score = analyze_text(text)#---------------------------------------------------------проверяем наш текст серез функцию прописаную выше и получаем Positive/Negative и уровень уверености в переменные label, score соответствено
        if label == "POSITIVE":#-------------------------------------------------------------------если ии считает что сообщ негатив то 
            positives = positives + 1#-------------------------------------------------------------счетчик негатива +
        elif label == "NEGATIVE":#-----------------------------------------------------------------если ии считает что сообщ позитив то 
            negatives = negatives + 1#-------------------------------------------------------------счетчик негатива +
        one_result = (text, label, score)#---------------------------------------------------------записываем результат в удобный формат
        results.append(one_result)#----------------------------------------------------------------записываем резултат в список который бддет записан в будщем в файле .txt
        print(f"{number}-{text}")#-----------------------------------------------------------------выводим номер отзыва и текст
        print(f" -> {label} ({str(score)})")#------------------------------------------------------выводим (positive/negative) и оценку ии
        number = number + 1#-----------------------------------------------------------------------идет к следующему номеру 
    total = len(results)#--------------------------------------------------------------------------количество всез отзывов
    print(f"\n")#----------------------------------------------------------------------------------просто с новой строки
    print(f"All revievs: {total}")#----------------------------------------------------------------выводим количество всех отзывов
    print(f"Positive: {positives}")#---------------------------------------------------------------выводим количесво позитивных
    print(f"Negative: {negatives}")#---------------------------------------------------------------выводим количество негативных
    save_results(results)#-------------------------------------------------------------------------записываем результат в файл .txt через функцию ниже


def save_results(results):#------------------------------------------------------------------------функция записи результата 
    try:#------------------------------------------------------------------------------------------пробуем
        f = open(RESULTS_FILE, "w", encoding="utf-8")#---------------------------------------------открыть файл, RESULTS_FILE-путь к файлу, w - записываем в файл, encoding="utf-8" - формат
    except Exception as e:#------------------------------------------------------------------------иначе
        print(f"Error with open file to read: {e}")#-----------------------------------------------вывести ошибку
        return#------------------------------------------------------------------------------------пусто
    try:#------------------------------------------------------------------------------------------пробуем
        for text, label, score in results:#--------------------------------------------------------перебираем все элементы списка results записывая их в text, label, score
            line = text + " | " + label + " | " + str(score) + "\n"#-------------------------------записываем строку со всеми параметрами 
            f.write(line)#-------------------------------------------------------------------------записываем эту строку в файл
    except Exception as e:#------------------------------------------------------------------------иначе ошибка
        print(f"error when try write to file: {e}")#-----------------------------------------------выводим ошибку
    f.close()#-------------------------------------------------------------------------------------закрываем подсоеденение к файлу
    print("result saved")#-------------------------------------------------------------------------выводим успех операции


def analyze_single(text):#-------------------------------------------------------------------------функция для проверки одиночного текста а не масива, по факту это просто analyze_text() но сразу с выводом информации в консоль
    if text == "" or text == None:#----------------------------------------------------------------проверка на пустотность ввода
        print("empty input")#---------------------------------------------------------------------вывод ишибки
        return#------------------------------------------------------------------------------------выход из функции чтобы не дошло до принтов и не дало ошибку
    label, score = analyze_text(text)#-------------------------------------------------------------используем функцию намного выше для анализа текста
    print(f"Text {text}")#-------------------------------------------------------------------------вывод текста
    print(f"label {label}")#-----------------------------------------------------------------------вывод позитив\неагтив
    print(f"score {str(score)}")#------------------------------------------------------------------вывод оценки уверености 